# Напечатай число
# На вход подаётся десятичное число в диапазоне [0; 99999999999].
# На выход нужно подать несколько строк - графический образ этого числа, составленный из
# образов отдельных цифр:
# Примеры вывода смотрите ниже...
# Пробелы за пределами напечатанного образа недопустимы...
# Sample Input 1:
# 21
# Sample Output 1:
# ##.#
# .###
# #..#
# ##.#

d = {
    0: ['##', '##', '##', '##'],
    1: ['.#', '##', '.#', '.#'],
    2: ['##', '.#', '#.', '##'],
    3: ['##', '.#', '.#', '##'],
    4: ['##', '##', '.#', '.#'],
    5: ['##', '#.', '.#', '##'],
    6: ['.#', '#.', '##', '##'],
    7: ['##', '.#', '#.', '#.'],
    8: ['##', '..', '##', '##'],
    9: ['##', '##', '.#', '#.'],
}
out = ['', '', '', '']

num = input()

ind = 0
for _ in range(4):
    for i in num:
        out[ind] += d.get(int(i))[ind]
    ind += 1


for i in out:
    print(i)
