"""
Вам доступны переменные city_name и city_year. В переменной city_name содержится строка – название города
(например, Владикавказ), а в переменной city_year содержится число – год основания города (например, 1784).
Напишите программу, которая выводит кортеж из значений этих двух переменных (сначала название города, затем год основания).
Примечание. Считайте, что переменные city_name и city_year уже объявлены в вашей программе, и вы имеете к ним доступ.
"""

city_name = 'Владикавказ'
city_year = 1784

print((city_name, city_year))
